БухЭксп/InformationRegisters/CW_ПризнакНаличияОригиналовДокументов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>CW_ПризнакНаличияОригиналовДокументов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ОригиналыПредоставлены</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаПолучения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ДокументСсылка</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.CW_РасходыПоПриобретениям</v8:Type>
						<v8:Type>cfg:DocumentRef.CW_ДоходыПоГрузоперевозке</v8:Type>
						<v8:Type>cfg:DocumentRef.CW_РасходыПоГрузоперевозке</v8:Type>
						<v8:Type>cfg:CatalogRef.CW_ДоговорыПоГрузоперевозкам</v8:Type>
						<v8:Type>cfg:DocumentRef.CW_РеализацияПрочихТоваровУслуг</v8:Type>
						<v8:Type>cfg:CatalogRef.CW_ПриложенияКДоговорам</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

БухЭксп/InformationRegisters/CW_ОтсутствующиеОригиналыДокументов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>CW_ОтсутствующиеОригиналыДокументов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Документ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.CW_РасходыПоПриобретениям</v8:Type>
						<v8:Type>cfg:DocumentRef.CW_ДоходыПоГрузоперевозке</v8:Type>
						<v8:Type>cfg:DocumentRef.CW_РасходыПоГрузоперевозке</v8:Type>
						<v8:Type>cfg:CatalogRef.CW_ДоговорыПоГрузоперевозкам</v8:Type>
						<v8:Type>cfg:DocumentRef.CW_РеализацияПрочихТоваровУслуг</v8:Type>
						<v8:Type>cfg:CatalogRef.CW_ПриложенияКДоговорам</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ДоговорыПоГрузоперевозкам</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидДоговора</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыДоговоровКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

БухЭксп/CommonModules/CW_ОригиналыДокументовСервер/Ext/Module.bsl
Процедура ПриСозданииНаСервере(Форма, Отказ, СтандартнаяОбработка) Экспорт
	
	Элементы 	= Форма.Элементы;	
	Объект 		= Форма.Объект;	  
	
	КонтролироватьПолучениеОригиналовОтКлиентов = Ложь;  
	ПравоКонтроляОригиналов = Ложь;
	
	Если ТипЗнч(Объект.Ссылка) = Тип("ДокументСсылка.CW_ДоходыПоГрузоперевозке")  
		ИЛИ ТипЗнч(Объект.Ссылка) = Тип("ДокументСсылка.CW_РеализацияПрочихТоваровУслуг") 	
		ИЛИ (ТипЗнч(Объект.Ссылка) = Тип("СправочникСсылка.CW_ДоговорыПоГрузоперевозкам") и
		Объект.ВидДоговора = ПредопределенноеЗначение("Перечисление.ВидыДоговоровКонтрагентов.СПокупателем")) 
		ИЛИ (ТипЗнч(Объект.Ссылка) = Тип("СправочникСсылка.CW_ПриложенияКДоговорам") и
		Объект.Договор.ВидДоговора = ПредопределенноеЗначение("Перечисление.ВидыДоговоровКонтрагентов.СПокупателем"))  Тогда   
		
		КонтролироватьПолучениеОригиналовОтКлиентов = ПолучитьФункциональнуюОпцию("CW_КонтролироватьПолучениеОригиналовОтКлиентов");
		ПравоКонтроляОригиналов	= CW_ПраваДоступа.ПравоДоступно("РедактированиеВозвратаОригиналовОтКлиента");  
	КонецЕсли;  
	
	Если ТипЗнч(Объект.Ссылка) = Тип("ДокументСсылка.CW_РасходыПоГрузоперевозке") 
		ИЛИ ТипЗнч(Объект.Ссылка) = Тип("ДокументСсылка.CW_РасходыПоПриобретениям") 	
		ИЛИ (ТипЗнч(Объект.Ссылка) = Тип("СправочникСсылка.CW_ДоговорыПоГрузоперевозкам") и
		Объект.ВидДоговора = ПредопределенноеЗначение("Перечисление.ВидыДоговоровКонтрагентов.СПоставщиком")) 
		ИЛИ (ТипЗнч(Объект.Ссылка) = Тип("СправочникСсылка.CW_ПриложенияКДоговорам") и
		Объект.Договор.ВидДоговора = ПредопределенноеЗначение("Перечисление.ВидыДоговоровКонтрагентов.СПоставщиком")) Тогда
		
		КонтролироватьПолучениеОригиналовОтКлиентов = ПолучитьФункциональнуюОпцию("CW_КонтролироватьПолучениеОригиналовОтПоставщиков"); 
		ПравоКонтроляОригиналов 					= CW_ПраваДоступа.ПравоДоступно("РедактированиеВозвратаОригиналовОтПоставщика");
	КонецЕсли;  
	
	Элементы.ГруппаОригиналы.Видимость = КонтролироватьПолучениеОригиналовОтКлиентов;
	
	Если Не КонтролироватьПолучениеОригиналовОтКлиентов Тогда
		Возврат;
	КонецЕсли;
	
	Элементы.ГруппаОригиналы.Доступность = ПравоКонтроляОригиналов;
	
	Если ТипЗнч(Объект.Ссылка) = Тип("ДокументСсылка.CW_ДоходыПоГрузоперевозке") Тогда
		УстанавливатьПризнакНаличияДляНовыхСчетов 	= Константы.CW_УстанавливатьПризнакНаличияОригиналовДляСчетов.Получить();
		Если УстанавливатьПризнакНаличияДляНовыхСчетов и Объект.Ссылка.Пустая() и Объект.ФормируетсяСчет и НЕ Объект.ФормируетсяАкт Тогда
			Форма.ОригиналыПредоставлены = истина;
			Форма.ОригиналыДатаВозврата  = ?(ЗначениеЗаполнено(Объект.ДатаСчета), Объект.ДатаСчета, ТекущаяДата());
		КонецЕсли;
	КонецЕсли;
	
	Если НЕ Объект.Ссылка.Пустая() Тогда
		СтруктураКонтроляОригиналов 	=  CW_Документы.ПолучитьПризнакНаличияИДатуВозвратаОригиналов(Объект.Ссылка);
		Форма.ОригиналыПредоставлены 	= СтруктураКонтроляОригиналов.ОригиналыПредоставлены;
		Форма.ОригиналыДатаВозврата 	= СтруктураКонтроляОригиналов.ДатаПолучения;
	КонецЕсли; 

	УстановитьВидимостьДатыВозврата(Форма, Элементы);
	
КонецПроцедуры

Процедура ПослеЗаписиНаСервере(Форма, ТекущийОбъект, ПараметрыЗаписи) Экспорт
	
	ОригиналыПредоставленыПриИзмененииНаСервере(Форма);
	
КонецПроцедуры

Процедура ПередЗаписьюНаСервере(Форма, ТекущийОбъект, ПараметрыЗаписи) Экспорт
	
	Элементы = Форма.Элементы;	
	Объект 	= Форма.Объект;	
	
	УстанавливатьПризнакНаличияДляНовыхСчетов 	= Константы.CW_УстанавливатьПризнакНаличияОригиналовДляСчетов.Получить();
	Если УстанавливатьПризнакНаличияДляНовыхСчетов и Объект.ФормируетсяСчет и НЕ Объект.ФормируетсяАкт Тогда
		Форма.ОригиналыПредоставлены 	= истина;
		Форма.ОригиналыДатаВозврата 	= ?(ЗначениеЗаполнено(Объект.ДатаСчета), Объект.ДатаСчета, ТекущаяДата());
	КонецЕсли;
	
КонецПроцедуры

Процедура УстановитьВидимостьДатыВозврата(Форма, Элементы)
	
	Элементы.ОригиналыДатаВозврата.Видимость = Форма.ОригиналыПредоставлены;

КонецПроцедуры

Процедура ОригиналыПредоставленыПриИзмененииНаСервере(Форма) Экспорт
	
	Элементы = Форма.Элементы;	
	Объект 	 = Форма.Объект;	
	
	УстановитьВидимостьДатыВозврата(Форма, Элементы);
	
	Если Форма.ОригиналыПредоставлены Тогда
		Если Не ЗначениеЗаполнено(Форма.ОригиналыДатаВозврата) Тогда
			Форма.ОригиналыДатаВозврата =  ТекущаяДата();  
		Конецесли
	Иначе
		Форма.ОригиналыДатаВозврата = Дата(1,1,1);  
	КонецЕсли;
	
	Если Не Объект.Ссылка.Пустая() Тогда
		
		ЗаписатьДанныеВРегистры(Объект, Форма);

	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработатьИзменениедатыВозвратаОригиналовДокументов(Форма, НоваяДата) Экспорт
	
	Элементы = Форма.Элементы;	
	Объект 	 = Форма.Объект;	

	Форма.ОригиналыДатаВозврата = НоваяДата;
	
	УстановитьВидимостьДатыВозврата(Форма, Элементы);
	
	Если Не Объект.Ссылка.Пустая() Тогда
		
		ЗаписатьДанныеВРегистры(Объект, Форма);

	Конецесли;
	
КонецПроцедуры

Процедура ЗаписатьДанныеВРегистры(Объект, Форма)
	
	Организация = Неопределено;
	Контрагент 	= Неопределено;
	Договор 	= Неопределено;

	ИмяМетаданного 	= Объект.Ссылка.Метаданные().имя;
	
	СоответствиеРеквиитаОрганизация = ПолучитьСоответствиеРеквиитаОрганизацияПоМетаданному();
	ВыражениеОрганизация = СоответствиеРеквиитаОрганизация.Получить(ИмяМетаданного);
	Если ВыражениеОрганизация <> Неопределено Тогда
		Организация = Вычислить(ВыражениеОрганизация);
	КонецЕсли;
	
	СоответствиеРеквиитаКонтрагент  = ПолучитьСоответствиеРеквиитаКонтрагентПоМетаданному();
	ВыражениеКонтрагент = СоответствиеРеквиитаКонтрагент.Получить(ИмяМетаданного);
	Если ВыражениеКонтрагент <> Неопределено Тогда
		Контрагент = Вычислить(ВыражениеКонтрагент);
	КонецЕсли;
	
	СоответствиеРеквиитаДоговор		= ПолучитьСоответствиеРеквиитаДоговорПоМетаданному();
	ВыражениеДоговор = СоответствиеРеквиитаДоговор.Получить(ИмяМетаданного);
	Если ВыражениеДоговор <> Неопределено Тогда
		Договор = Вычислить(ВыражениеДоговор);
	КонецЕсли;
	
	ДанныеДлязаписи = Новый Структура;
	ДанныеДлязаписи.Вставить("ЗаписьНового"			, Ложь);
	ДанныеДлязаписи.Вставить("Ссылка"				, Объект.Ссылка);
	ДанныеДлязаписи.Вставить("Признак"				, Форма.ОригиналыПредоставлены);
	ДанныеДлязаписи.Вставить("ДатаВозврата" 		, Форма.ОригиналыДатаВозврата);
	
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Объект.Ссылка, "ВедомыйДокумент") Тогда
		ДанныеДлязаписи.Вставить("ВедомыйДокумент" 		, Объект.Ссылка.ВедомыйДокумент);
	КонецЕсли;
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Объект.Ссылка, "ВедомыйСчетФактура") Тогда
		ДанныеДлязаписи.Вставить("ВедомыйСчетФактура" 	, Объект.Ссылка.ВедомыйСчетФактура);
	КонецЕсли;
	
	РегистрыСведений.CW_ПризнакНаличияОригиналовДокументов.ЗаписатьНаличеОригиналов(ДанныеДлязаписи);
	
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("Ссылка"		, Объект.Ссылка);
	СтруктураПараметров.Вставить("Организация"	, Организация);  	
	СтруктураПараметров.Вставить("Контрагент"	, Контрагент); 		
	СтруктураПараметров.Вставить("Договор" 		, Договор);			
	СтруктураПараметров.Вставить("Признак"		, Форма.ОригиналыПредоставлены);
	
	РегистрыСведений.CW_ОтсутствующиеОригиналыДокументов.ЗаписатьОтсутствующиеОригиналыДокументов(СтруктураПараметров);

КонецПроцедуры

Функция ПолучитьСоответствиеРеквиитаОрганизацияПоМетаданному()
	
	Результат = Новый Соответствие;
	
	Результат.Вставить("CW_ДоговорыПоГрузоперевозкам",	"Объект.Организация");
	Результат.Вставить("CW_ПриложенияКДоговорам",		"Объект.Договор.Организация");
	
	Результат.Вставить("CW_ДоходыПоГрузоперевозке",			"Объект.Организация");
	Результат.Вставить("CW_РасходыПоГрузоперевозке",		"Объект.Организация");
	Результат.Вставить("CW_РасходыПоПриобретениям",			"Объект.Организация");
	Результат.Вставить("CW_РеализацияПрочихТоваровУслуг", 	"Объект.Организация");
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьСоответствиеРеквиитаКонтрагентПоМетаданному()
	
	Результат = Новый Соответствие;
	
	Результат.Вставить("CW_ДоговорыПоГрузоперевозкам",	"Объект.Владелец");
	Результат.Вставить("CW_ПриложенияКДоговорам",		"Объект.Договор.Владелец");
	
	Результат.Вставить("CW_ДоходыПоГрузоперевозке",			"Объект.Контрагент");
	Результат.Вставить("CW_РасходыПоГрузоперевозке",		"Объект.Контрагент");
	Результат.Вставить("CW_РасходыПоПриобретениям",			"Объект.Контрагент");
	Результат.Вставить("CW_РеализацияПрочихТоваровУслуг", 	"Объект.Контрагент");
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьСоответствиеРеквиитаДоговорПоМетаданному()
	
	Результат = Новый Соответствие;
	
	Результат.Вставить("CW_ДоговорыПоГрузоперевозкам",	"Объект.Ссылка");
	Результат.Вставить("CW_ПриложенияКДоговорам",		"Объект.Договор");
	
	Результат.Вставить("CW_ДоходыПоГрузоперевозке",			"Объект.Договор");
	Результат.Вставить("CW_РасходыПоГрузоперевозке",		"Объект.Договор");
	Результат.Вставить("CW_РасходыПоПриобретениям",			"Объект.Договор");
	Результат.Вставить("CW_РеализацияПрочихТоваровУслуг", 	"Объект.Договор");

	Возврат Результат;
	
КонецФункции

Функция ПолучитьПредставлениеДокумента(Документ)  Экспорт
	
	ЕстьРеквизитОбъекта = ОбщегоНазначения.ЕстьРеквизитОбъекта("ПредставлениеДокумента", Документ.Метаданные());
	
	Если ЕстьРеквизитОбъекта Тогда
		Возврат СокрЛП(Документ.ПредставлениеДокумента);
	КонецЕсли;
	
	Возврат СокрЛП(Документ);
	
КонецФункции
